Repository: wangchong2023/ZhiYu
Catalog: Sources/Localization/Catalogs/Plugin.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# plugin.noPluginsInCategory
source: No Installed Plugins in Category
zh_hans: 该分类下暂无已安装插件
zh_hant: 该分類下暫無已安装插件

# plugin.noPluginsInCategoryHint
source: Try switching to other categories
zh_hans: 尝试切换到其他分类查看
zh_hant: 嚐試切換到其他分類查看

# plugin.stats.cpu
source: CPU
zh_hans: 处理器
zh_hant: 處理器

# plugin.stats.ratio
source: Ratio
zh_hans: 占比
zh_hant: 佔比

# plugin.stats.totalExecutionTime
source: Total Execution Time: %1$@
zh_hans: 总执行时间: %1$@
zh_hant: 總執行時間: %1$@

# plugin.stats.enabledCount
source: Enabled Plugins
zh_hans: 已启用插件
zh_hant: 已啟用插件

# plugin.stats.activeCount
source: Running Plugins
zh_hans: 运行中插件
zh_hant: 運行中插件

# plugin.category.all
source: All
zh_hans: 全部
zh_hant: 全部

# plugin.category.social
source: Social
zh_hans: 社交
zh_hant: 社交

# plugin.category.other
source: Other
zh_hans: 其他
zh_hant: 其他

# collab.connectedUsers
source: Connected Users
zh_hans: 已连接的用户
zh_hant: 已連線的使用者

# collab.defaultRoom
source: ZhiYu Room
zh_hans: 知识库协作房间
zh_hant: 知識庫協作房間

# collab.error.connectionTimeout
source: Connection timed out. Please try again.
zh_hans: 连接超时，请重试
zh_hant: 連線超時，請重試

# collab.error.noPermission
source: You do not have permission to edit
zh_hans: 您没有编辑权限
zh_hant: 您沒有編輯權限

# collab.hostSession
source: Host Session
zh_hans: 开启协作会话
zh_hant: 開啟協作會話

# collab.hostSetup
source: Set Up Collaboration Room
zh_hans: 设置协作房间
zh_hant: 設定協作房間

# collab.hostedBy
source: Hosted by
zh_hans: 主持人:
zh_hant: 主持人:

# collab.howItWorks
source: How It Works
zh_hans: 工作原理
zh_hant: 工作原理

# collab.info.encrypted
source: End-to-end encrypted
zh_hans: 端到端加密传输
zh_hant: 端到端加密傳輸

# collab.info.local
source: Connect via local Wi-Fi / Bluetooth
zh_hans: 通过本地 Wi-Fi / 蓝牙直连
zh_hant: 通過本地 Wi-Fi / 藍牙直連

# collab.info.maxPeers
source: Supports up to 8 collaborators
zh_hans: 最多支持 8 位协作者
zh_hant: 最多支援 8 位協作者

# collab.joinSession
source: Join Session
zh_hans: 加入协作会话
zh_hant: 加入協作會話

# collab.leaveSession
source: Leave Session
zh_hans: 离开协作
zh_hant: 離開協作

# collab.nearbyRooms
source: Nearby Rooms
zh_hans: 附近的协作房间
zh_hant: 附近的協作房間

# collab.noEdits
source: No edits yet
zh_hans: 暂无编辑记录
zh_hant: 暫無編輯記錄

# collab.noNearbyRooms
source: No nearby rooms found
zh_hans: 未发现附近的房间
zh_hant: 未發現附近的房間

# collab.recentEdits
source: Recent Edits
zh_hans: 最近的编辑
zh_hant: 最近的編輯

# collab.role.editor
source: Editor
zh_hans: 编辑者
zh_hant: 編輯者

# collab.role.owner
source: Owner
zh_hans: 主持人
zh_hant: 主持人

# collab.role.viewer
source: Viewer
zh_hans: 查看者
zh_hant: 查看者

# collab.roomName
source: Room Name
zh_hans: 房间名称
zh_hant: 房間名稱

# collab.roomNamePlaceholder
source: Enter room name
zh_hans: 输入房间名称
zh_hant: 輸入房間名稱

# collab.searching
source: Searching...
zh_hans: 正在搜索...
zh_hant: 正在搜尋...

# collab.simulatorWarning
source: MultipeerConnectivity is unavailable on the Simulator. Please test collaboration on a real device.
zh_hans: MultipeerConnectivity 在模拟器上不可用，请在真机上测试协作功能。
zh_hant: MultipeerConnectivity 在模擬器上不可用，請在真機上测試協作功能。

# collab.startHosting
source: Start Hosting
zh_hans: 开始主持
zh_hant: 開始主持

# collab.status.advertiseError
source: Advertising failed
zh_hans: 广播失败
zh_hant: 廣播失敗

# collab.status.browseError
source: Browsing failed
zh_hans: 搜索失败
zh_hant: 搜尋失敗

# collab.status.connected
source: Connected
zh_hans: 已连接
zh_hant: 已連線

# collab.status.connecting
source: Connecting...
zh_hans: 连接中...
zh_hant: 連線中...

# collab.status.disconnected
source: Disconnected
zh_hans: 已断开
zh_hant: 已斷開

# collab.status.hosting
source: Hosting collaboration
zh_hans: 正在主持协作
zh_hant: 正在主持協作

# collab.status.joining
source: Joining...
zh_hans: 正在加入...
zh_hant: 正在加入...

# collab.status.pageReceived
source: Page sync received
zh_hans: 收到页面同步
zh_hant: 收到頁面同步

# collab.status.ready
source: Ready
zh_hans: 就绪
zh_hant: 就緒

# collab.status.searching
source: Searching for nearby rooms...
zh_hans: 正在搜索附近的协作房间...
zh_hant: 正在搜尋附近的協作房間...

# collab.status.simulatorNotSupported
source: Simulator does not support local collaboration
zh_hans: 模拟器不支持本地协作
zh_hant: 模擬器不支援本地協作

# collab.stopSearching
source: Stop Searching
zh_hans: 停止搜索
zh_hant: 停止搜尋

# collab.subtitle
source: Real-time collaboration with others over local network
zh_hans: 通过本地网络与他人实时协作编辑知识库
zh_hant: 通過本地網路与他人實時協作編輯知識庫

# collab.username
source: Username
zh_hans: 用户名
zh_hant: 使用者名

# collab.usernamePlaceholder
source: Enter your name
zh_hans: 输入你的名字
zh_hant: 輸入你的名字

# plugin.action.confirmInstall
source: Confirm Installation
zh_hans: 确认安装插件
zh_hant: 確認安装插件

# plugin.action.install
source: Install
zh_hans: 安装
zh_hant: 安装

# plugin.action.uninstall
source: Uninstall
zh_hans: 卸载
zh_hant: 卸載

source: Plugin Center
zh_hans: 插件中心
zh_hant: 插件中心

# plugin.commands.title
source: Plugin Commands
zh_hans: 插件指令
zh_hant: 插件指令

# plugin.local.desc
source: Select a local .bundle or .js script
zh_hans: 选择本地的 .bundle 或 .js 脚本
zh_hant: 選擇本地的 .bundle 或 .js 腳本

# plugin.local.mount
source: Load Local Plugin
zh_hans: 加载本地插件
zh_hant: 加載本地插件

source: Plugin Market
zh_hans: 插件市场
zh_hant: 插件市場

# plugin.market.connectionError
source: Cannot connect to Plugin Market. Please check your network connection.
zh_hans: 无法连接插件市场，请检查您的网络连接。
zh_hant: 無法連線插件市場，請检查您的網路連線。

# plugin.market.empty
source: No plugins available
zh_hans: 暂无上架插件
zh_hant: 暫無上架插件

# plugin.market.emptyHint
source: Check the developer community for updates
zh_hans: 去开发者社区看看最新动态吧
zh_hant: 去開發者社區看看最新動態吧

# plugin.myPlugins
source: My Plugins
zh_hans: 我的插件
zh_hant: 我的插件

# plugin.noPlugins
source: No Plugins
zh_hans: 暂无插件
zh_hant: 暫無插件

# plugin.noPluginsHint
source: Go to the plugin market to find surprises
zh_hans: 去插件市场发现惊喜吧
zh_hant: 去插件市場發現惊喜吧

# plugin.noResults
source: No Plugins Found
zh_hans: 未找到插件
zh_hant: 未找到插件

# plugin.noResultsHint
source: Try a different search term
zh_hans: 尝试更换搜索词
zh_hant: 嚐試更換搜尋词

# plugin.perm.content
source: Content Mod
zh_hans: 内容修改
zh_hant: 內容修改

# plugin.perm.none
source: No special permissions
zh_hans: 无特殊权限
zh_hant: 無特殊權限

# plugin.perm.sandbox
source: Sandbox
zh_hans: 沙盒安全
zh_hant: 沙盒安全

# plugin.permission.title
source: Plugin Permissions
zh_hans: 插件授权申请
zh_hant: 插件授權申請

# plugin.safeMode
source: Safe Mode
zh_hans: 安全模式
zh_hant: 安全模式

# plugin.safeMode.turnOff
source: Turn Off Anyway
zh_hans: 仍然关闭
zh_hant: 仍然關閉

# plugin.safeMode.warning.message
source: Turning off Safe Mode allows loading unverified local plugins. These plugins may access your private data or system resources. Are you sure you want to proceed?
zh_hans: 关闭安全模式后，系统将允许加载未经审核的本地插件。这些插件可能获取您的隐私数据或系统资源访问权限。建议仅在信任插件来源时关闭。确认关闭吗？
zh_hant: 關閉安全模式後，係統將允許加載未經審核的本地插件。這些插件可能獲取您的隱私資料或係統資源访問權限。建議仅在信任插件來源時關閉。確認關閉吗？

# plugin.safeMode.warning.title
source: Security Risk Warning
zh_hans: 安全风险提示
zh_hant: 安全風險提示

# plugin.searchPlaceholder
source: Search plugins...
zh_hans: 搜索插件...
zh_hant: 搜尋插件...

# plugin.section.about
source: About Plugin
zh_hans: 关于此插件
zh_hant: 關於此插件

# plugin.section.permissions
source: Required Permissions
zh_hans: 所需权限
zh_hant: 所需權限

# plugin.stat.rating
source: Rating
zh_hans: 评分
zh_hant: 評分

# plugin.stats.downloads
source: Downloads
zh_hans: 下载量
zh_hant: 下載量

# plugin.status.disabled
source: Disabled
zh_hans: 已禁用
zh_hant: 已停用

# plugin.status.enabled
source: Enabled
zh_hans: 已启用
zh_hant: 已啟用

# section.pluginSettings
source: Plugin Settings
zh_hans: 插件设置
zh_hant: 插件設定

# section.rag
source: AI Context
zh_hans: AI 辅助认知
zh_hant: AI 辅助認知

# sidebar.currentSources
source: Current Sources
zh_hans: 当前参考信源
zh_hant: 当前参考信源

# plugin.stats.resourceUsage
source: Plugin Resource Usage (Watchdog 2.0)
zh_hans: 插件资源占用 (Watchdog 2.0)
zh_hant: 插件資源佔用 (Watchdog 2.0)

# plugin.stats.noUsage
source: No active plugin stats
zh_hans: 暂无活跃插件统计
zh_hant: 暫無活跃插件統计

# plugin.stats.callCountFormat
source: Calls: %lld | Avg: %.1fms
zh_hans: 调用次数: %lld | 平均耗时: %.1fms
zh_hant: 調用次數: %lld | 平均耗時: %.1fms

# plugin.settings.noSettings
source: This plugin does not provide customizable options yet.
zh_hans: 该插件尚未提供可配置的选项。
zh_hant: 该插件尚未提供可設定的選項。

# plugin.error.sandboxBlocked
source: Sandbox Intercepted: High-risk system/network keywords detected in the plugin script. Execution blocked!
zh_hans: 沙盒拦截：检测到插件脚本中包含高危底层系统/网络操作关键字，执行被阻断！
zh_hant: 沙盒拦截：检测到插件腳本中包含高危底层係統/網路操作關鍵字，執行被阻斷！

# plugin.error.dlpScriptBlocked
source: DLP Intercepted: High-risk data exfiltration keywords detected in the plugin script. Execution blocked!
zh_hans: DLP 拦截：检测到插件脚本中包含高危数据外泄(Data Exfiltration)网络连接关键字，执行被阻断！
zh_hant: DLP 拦截：检测到插件腳本中包含高危資料外洩(Data Exfiltration)網路連線關鍵字，執行被阻斷！

# plugin.error.dlpFetchBlocked
source: DLP Intercepted: This plugin attempted unauthorized external network transmission to (%@) (fetch)
zh_hans: DLP 拦截：此插件试图发起向未授权外网域名(%@)的网络传输(fetch)
zh_hant: DLP 拦截：此插件試圖發起向未授權外網域名(%@)的網路傳輸(fetch)

# plugin.error.preProcessException
source: Plugin pre-process execution exception or CPU time limit exceeded: %@
zh_hans: 插件预处理执行异常或 CPU 时间超限: %@
zh_hant: 插件預處理執行異常或 CPU 時間超限: %@

# plugin.error.payloadTooLarge
source: Plugin returned payload too large (Payload Too Large)
zh_hans: 插件返回数据过大 (Payload Too Large)
zh_hant: 插件返回資料過大 (Payload Too Large)

# plugin.error.postProcessException
source: Plugin post-process execution exception or CPU time limit exceeded: %@
zh_hans: 插件后处理执行异常或 CPU 时间超限: %@
zh_hant: 插件後處理執行異常或 CPU 時間超限: %@

# plugin.error.invalidURL
source: Invalid network request URL: %@
zh_hans: 无效的网络请求地址: %@
zh_hant: 無效的網路請求地址: %@

# plugin.error.keyLengthExceeded
source: Storage key name length exceeded limit (%d characters)
zh_hans: 存储键名超过最大长度限制 (%d 字符)
zh_hant: 存储鍵名超過最大長度限制 (%d 字符)

# plugin.error.permissionDenied
source: Permission denied: plugin attempted to use '%@' without declaring it in manifest
zh_hans: 权限拒绝：插件未在 manifest 中声明 '%@' 权限即尝试调用
zh_hant: 權限拒絕：插件未在 manifest 中聲明 '%@' 權限即嘗試調用

# plugin.permission.message
source: Plugin "%@" requires the following permissions to function
zh_hans: 插件「%@」需要以下权限才能正常工作
zh_hant: 插件「%@」需要以下權限才能正常工作

# plugin.detail.byAuthor
source: by %@
zh_hans: 作者：%@
zh_hant: 作者：%@

# plugin.detail.downloadsUnit
source: installs
zh_hans: 次安装
zh_hant: 次安装

# plugin.detail.installed
source: Installed
zh_hans: 已安装
zh_hant: 已安装

# plugin.detail.metadata
source: Details
zh_hans: 详细信息
zh_hant: 詳細資訊

# plugin.detail.readMore
source: Read More
zh_hans: 阅读更多
zh_hant: 閱讀更多

# plugin.detail.showLess
source: Show Less
zh_hans: 折叠
zh_hant: 折叠

# plugin.detail.ratings
source: Ratings
zh_hans: 评分
zh_hant: 評分

# plugin.detail.secure
source: Secure
zh_hans: 安全
zh_hant: 安全

# plugin.detail.securePassed
source: Passed
zh_hans: 已通过
zh_hant: 已通過

# plugin.detail.allPlatforms
source: All Platforms
zh_hans: 全平台
zh_hant: 全平臺

# plugin.detail.compatibility
source: Compatibility
zh_hans: 兼容性
zh_hant: 兼容性

# plugin.detail.version
source: Version
zh_hans: 版本
zh_hant: 版本

# plugin.detail.author
source: Author
zh_hans: 作者
zh_hant: 作者

# plugin.detail.minAppVersion
source: Min App Version
zh_hans: 最低应用版本
zh_hant: 最低套用版本

# plugin.detail.category
source: Category
zh_hans: 分类
zh_hant: 分類

# plugin.detail.license
source: License
zh_hans: 许可
zh_hant: 許可

# plugin.detail.report
source: Report
zh_hans: 报告
zh_hant: 报告

# plugin.detail.reportIssue
source: Report Issue
zh_hans: 报告问题
zh_hant: 报告問題

# plugin.detail.viewSource
source: View Source
zh_hans: 查看源码
zh_hant: 查看源碼

# plugin.detail.category.local
source: Local Plugin
zh_hans: 本地插件
zh_hant: 本地插件

# plugin.detail.category.remote
source: Remote Plugin
zh_hans: 远程插件
zh_hant: 遠程插件

# plugin.detail.category.community
source: Community Plugin
zh_hans: 社区插件
zh_hant: 社區插件

# plugin.detail.category.unknown
source: Unknown Source
zh_hans: 未知来源
zh_hant: 未知來源

# plugin.detail.license.free
source: MIT License
zh_hans: MIT 开源协议
zh_hant: MIT 開源協議

# plugin.detail.license.donation
source: Free (Donation)
zh_hans: 免费（赞助）
zh_hant: 免費（贊助）

# plugin.detail.license.subscription
source: Subscription
zh_hans: 订阅制
zh_hant: 订閱制

# plugin.perm.writeContent
source: Content Modification
zh_hans: 内容修改
zh_hant: 內容修改

# plugin.perm.readContent
source: Content Reading
zh_hans: 内容读取
zh_hant: 內容讀取

# plugin.perm.aiAccess
source: AI Service Access
zh_hans: AI 服务访问
zh_hant: AI 服務访問

# plugin.perm.log
source: Log Recording
zh_hans: 日志记录
zh_hant: 日誌記錄

# plugin.perm.content.desc
source: Modify document content, clean formatting, generate tables of contents etc.
zh_hans: 修改文档内容，清洗格式、生成目录等
zh_hant: 修改文档內容，清洗格式、生成目錄等

# plugin.perm.readContent.desc
source: Read document content for analysis, statistics, and processing.
zh_hans: 读取文档内容以进行分析、统计和处理
zh_hant: 讀取文档內容以進行分析、統计和處理

# plugin.perm.network.desc
source: Access the internet to fetch web page data or call external APIs.
zh_hans: 访问互联网以获取网页数据或调用外部 API
zh_hant: 访問互联網以獲取網頁資料或調用外部 API

# plugin.perm.aiAccess.desc
source: Call ZhiYu AI service for translation, summarization and other smart features.
zh_hans: 调用智宇 AI 服务进行翻译、摘要等智能处理
zh_hant: 調用智宇 AI 服務進行翻譯、摘要等智能處理

# plugin.perm.log.desc
source: Write operation logs for debugging and statistics purposes.
zh_hans: 写入操作日志用于调试和统计
zh_hant: 寫入操作日誌用於調試和統计

# plugin.perm.sandbox.desc
source: Access the local file system within the sandbox for reading and writing files.
zh_hans: 在沙盒内访问本地文件系统进行文件读写
zh_hant: 在沙盒內访問本地檔案係統進行檔案讀寫

# plugin.perm.unknown.desc
source: This plugin requests permission: %@
zh_hans: 此插件请求权限：%@
zh_hant: 此插件請求權限：%@

# plugin.section.ribbon
source: Quick Actions
zh_hans: 快捷功能区
zh_hant: 快捷功能區

# collab.title
source: Collaboration
zh_hans: 协作中心
zh_hant: 協作中心

# plugin.perm.network
source: Network
zh_hans: 网络访问
zh_hant: 網路访問

# plugin.category.reading
source: Reading
zh_hans: 阅读
zh_hant: 閱讀

# collab.room
source: ZhiYu Room
zh_hans: 知识库 Room
zh_hant: 知識庫 Room
